load/results/before/baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * mixed_steady: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 1020 complete and 0 interrupted iterations
mixed_steady   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 2049 complete and 0 interrupted iterations
mixed_steady   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 3081 complete and 0 interrupted iterations
mixed_steady   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 4113 complete and 0 interrupted iterations
mixed_steady   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 5139 complete and 0 interrupted iterations
mixed_steady   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 6175 complete and 0 interrupted iterations
mixed_steady   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 7194 complete and 0 interrupted iterations
mixed_steady   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 8244 complete and 0 interrupted iterations
mixed_steady   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 9274 complete and 0 interrupted iterations
mixed_steady   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 10280 complete and 0 interrupted iterations
mixed_steady   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 11281 complete and 0 interrupted iterations
mixed_steady   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 12262 complete and 0 interrupted iterations
mixed_steady   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 13259 complete and 0 interrupted iterations
mixed_steady   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 14270 complete and 0 interrupted iterations
mixed_steady   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 15280 complete and 0 interrupted iterations
mixed_steady   [ 100% ] 10 VUs  15.0s/15s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 76450   5095.134729/s
    checks_succeeded...: 100.00% 76450 out of 76450
    checks_failed......: 0.00%   0 out of 76450

    ✓ 278 ok
    ✓ 835 ok
    ✓ hl7 ok
    ✓ fhir ok
    ✓ decide ok

    HTTP
    http_req_duration..............: avg=1.93ms min=214µs  med=1.87ms p(95)=2.56ms  p(99)=2.92ms  max=6.24ms 
      { expected_response:true }...: avg=1.93ms min=214µs  med=1.87ms p(95)=2.56ms  p(99)=2.92ms  max=6.24ms 
    http_req_failed................: 0.00% 0 out of 76450
    http_reqs......................: 76450 5095.134729/s

    EXECUTION
    iteration_duration.............: avg=9.8ms  min=6.64ms med=9.76ms p(95)=10.95ms p(99)=11.98ms max=15.75ms
    iterations.....................: 15290 1019.026946/s
    vus............................: 10    min=10         max=10
    vus_max........................: 10    min=10         max=10

    NETWORK
    data_received..................: 18 MB 1.2 MB/s
    data_sent......................: 35 MB 2.3 MB/s



running (15.0s), 00/10 VUs, 15290 complete and 0 interrupted iterations
mixed_steady ✓ [ 100% ] 10 VUs  15s