load/results/before/fhir_sweep_vus10.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 3684 complete and 0 interrupted iterations
fhir_steady   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 7391 complete and 0 interrupted iterations
fhir_steady   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 11109 complete and 0 interrupted iterations
fhir_steady   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 14741 complete and 0 interrupted iterations
fhir_steady   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 18428 complete and 0 interrupted iterations
fhir_steady   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 22091 complete and 0 interrupted iterations
fhir_steady   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 25785 complete and 0 interrupted iterations
fhir_steady   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 29489 complete and 0 interrupted iterations
fhir_steady   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 33104 complete and 0 interrupted iterations
fhir_steady   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 36737 complete and 0 interrupted iterations
fhir_steady   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 40429 complete and 0 interrupted iterations
fhir_steady   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 44115 complete and 0 interrupted iterations
fhir_steady   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 47902 complete and 0 interrupted iterations
fhir_steady   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 51419 complete and 0 interrupted iterations
fhir_steady   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 55095 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 10 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 110232  7347.427501/s
    checks_succeeded...: 100.00% 110232 out of 110232
    checks_failed......: 0.00%   0 out of 110232

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=2.69ms min=1.97ms med=2.59ms p(95)=3.14ms p(99)=3.56ms max=11.7ms 
      { expected_response:true }...: avg=2.69ms min=1.97ms med=2.59ms p(95)=3.14ms p(99)=3.56ms max=11.7ms 
    http_req_failed................: 0.00%  0 out of 55116
    http_reqs......................: 55116  3673.71375/s

    EXECUTION
    iteration_duration.............: avg=2.71ms min=2.04ms med=2.62ms p(95)=3.17ms p(99)=3.6ms  max=11.73ms
    iterations.....................: 55116  3673.71375/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 16 MB  1.1 MB/s
    data_sent......................: 5.2 MB 345 kB/s



running (15.0s), 00/10 VUs, 55116 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 10 VUs  15s