load/results/before/fhir_sweep_vus120.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 120 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 120 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 120/120 VUs, 3750 complete and 0 interrupted iterations
fhir_steady   [   7% ] 120 VUs  01.0s/15s

running (02.0s), 120/120 VUs, 7265 complete and 0 interrupted iterations
fhir_steady   [  13% ] 120 VUs  02.0s/15s

running (03.0s), 120/120 VUs, 10867 complete and 0 interrupted iterations
fhir_steady   [  20% ] 120 VUs  03.0s/15s

running (04.0s), 120/120 VUs, 14303 complete and 0 interrupted iterations
fhir_steady   [  27% ] 120 VUs  04.0s/15s

running (05.0s), 120/120 VUs, 17996 complete and 0 interrupted iterations
fhir_steady   [  33% ] 120 VUs  05.0s/15s

running (06.0s), 120/120 VUs, 21795 complete and 0 interrupted iterations
fhir_steady   [  40% ] 120 VUs  06.0s/15s

running (07.0s), 120/120 VUs, 25460 complete and 0 interrupted iterations
fhir_steady   [  47% ] 120 VUs  07.0s/15s

running (08.0s), 120/120 VUs, 29088 complete and 0 interrupted iterations
fhir_steady   [  53% ] 120 VUs  08.0s/15s

running (09.0s), 120/120 VUs, 32820 complete and 0 interrupted iterations
fhir_steady   [  60% ] 120 VUs  09.0s/15s

running (10.0s), 120/120 VUs, 36459 complete and 0 interrupted iterations
fhir_steady   [  67% ] 120 VUs  10.0s/15s

running (11.0s), 120/120 VUs, 39975 complete and 0 interrupted iterations
fhir_steady   [  73% ] 120 VUs  11.0s/15s

running (12.0s), 120/120 VUs, 43675 complete and 0 interrupted iterations
fhir_steady   [  80% ] 120 VUs  12.0s/15s

running (13.0s), 120/120 VUs, 47325 complete and 0 interrupted iterations
fhir_steady   [  87% ] 120 VUs  13.0s/15s

running (14.0s), 120/120 VUs, 51082 complete and 0 interrupted iterations
fhir_steady   [  93% ] 120 VUs  14.0s/15s

running (15.0s), 120/120 VUs, 54879 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 120 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 110054  7322.280961/s
    checks_succeeded...: 100.00% 110054 out of 110054
    checks_failed......: 0.00%   0 out of 110054

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=32.7ms  min=3.66ms med=31.82ms p(95)=37.02ms p(99)=54.89ms max=91.27ms
      { expected_response:true }...: avg=32.7ms  min=3.66ms med=31.82ms p(95)=37.02ms p(99)=54.89ms max=91.27ms
    http_req_failed................: 0.00%  0 out of 55027
    http_reqs......................: 55027  3661.14048/s

    EXECUTION
    iteration_duration.............: avg=32.73ms min=4.71ms med=31.85ms p(95)=37.08ms p(99)=54.93ms max=91.33ms
    iterations.....................: 55027  3661.14048/s
    vus............................: 120    min=120        max=120
    vus_max........................: 120    min=120        max=120

    NETWORK
    data_received..................: 16 MB  1.1 MB/s
    data_sent......................: 5.2 MB 344 kB/s



running (15.0s), 000/120 VUs, 55027 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 120 VUs  15s